app/controllers/comments_controller.rb

  def create
    @concert = Concert.find params[:concert_id]
    @comment = @concert.comments.new comment_params
    if @comment.save
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("comment", "concert_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "hey"], ["concert_id", 1], ["created_at", "2016-02-27 11:34:25.485510"], ["updated_at", "2016-02-27 11:34:25.485510"]]