app/controllers/concerts_controller.rb

  def home
    @concert = Concert.all
---
SELECT "concerts".* FROM "concerts"

  def index
    from = Time.now.midnight
    to = Time.now.midnight + 1.day
    @concert = Concert.where(date: from..to)
---
SELECT "concerts".* FROM "concerts" WHERE ("concerts"."date" BETWEEN '2016-02-25 23:00:00.000000' AND '2016-02-26 23:00:00.000000')

  def create
    @concert = Concert.new entry_params
    if @concert.save
---
INSERT INTO "concerts" ("artist", "venue", "city", "price", "description", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def show
      @concert = Concert.find_by(id: params[:id])
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", 7]]