app/controllers/concerts_controller.rb

  def index
    @concert = Concert.all
---
SELECT "concerts".* FROM "concerts"