app/controllers/site_controller.rb

  def home
    @concert = Concert.all
---
SELECT "concerts".* FROM "concerts"